pages/docs/status-tabelle/index.html
<title>Beleg-Art Tabelle</title>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Tabelle erstellen</h2>
<div class="outline-text-2" id="text-orgheadline1">
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #490026; font-weight: bold;">CREATE</span> <span style="color: #490026; font-weight: bold;">TABLE</span> IF <span style="color: #490026; font-weight: bold;">NOT</span> <span style="color: #490026; font-weight: bold;">EXISTS</span> <span style="color: #340557; font-weight: bold;">beleg_art</span> (
        art_id <span style="color: #014500;">INT</span>(11) <span style="color: #490026; font-weight: bold;">NOT</span> <span style="color: #490026; font-weight: bold;">NULL</span> AUTO_INCREMENT <span style="color: #490026; font-weight: bold;">PRIMARY</span> <span style="color: #490026; font-weight: bold;">KEY</span>,
        bezeichnung <span style="color: #014500;">VARCHAR</span>(45),
        color <span style="color: #014500;">VARCHAR</span>(6));
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Mit Testdaten befüllen</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
Neben des Standard-Status 'frei' gibt es drei Stadien in denen sich ein Zimmer befinden kann.  
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #490026; font-weight: bold;">INSERT</span> <span style="color: #490026; font-weight: bold;">INTO</span> beleg_art (bezeichnung, color) <span style="color: #490026; font-weight: bold;">VALUES</span>
(<span style="color: #0f126e;">'belegt'</span>, <span style="color: #0f126e;">'FFFFFF'</span>),
(<span style="color: #0f126e;">'gesperrt'</span>, <span style="color: #0f126e;">'0000FF'</span>),
(<span style="color: #0f126e;">'reserviert'</span>, <span style="color: #0f126e;">'FFFF00'</span>);
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" drawer="Belegt-Art-Tabelle">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ID</th>
<th scope="col" class="org-left">Bezeichnung</th>
<th scope="col" class="org-left">Farbkennung</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">belegt</td>
<td class="org-left">FFFFFF</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">gesperrt</td>
<td class="org-left">0000FF</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">reserviert</td>
<td class="org-left">FFFF00</td>
</tr>
</tbody>
</table>
</div>
</div>
